{
  "personal": {
    "firstName": "Münevver",
    "lastName": "Aslan",
    "title": "Digital Product Designer",
    "location": "Lisbon, Portugal",
    "email": "munevveraslan2@gmail.com",
    "portfolio": "https://munevver.netlify.app",
    "linkedin": "munevveraslan",
    "quote": "Everything is design. Everything!"
  },
  "summary": "Product Designer with Industrial Design background, specializing in UI/UX for digital products and AI-powered design workflows. Experienced in building design systems from scratch and leading 0-to-1 product launches. Expert in leveraging AI tools (Midjourney, Cursor) for rapid prototyping, development, and design-to-code workflows. Passionate about translating complex technical requirements into intuitive, accessible interfaces through close collaboration with engineering teams.",
  "skills": [
    {
      "category": "Design Tools",
      "items": "Figma (Advanced), Adobe Creative Suite (Photoshop, Illustrator, Lightroom), Midjourney, Cursor, Sketch, Adobe XD"
    },
    {
      "category": "UX Design",
      "items": "User Experience Design, User Research, Information Architecture, User Flows, Journey Mapping, Persona Development"
    },
    {
      "category": "UI Design",
      "items": "User Interface Design, Visual Design, Wireframing, Prototyping, Design Systems, Component Libraries"
    },
    {
      "category": "Methodology",
      "items": "Agile/Scrum, AI-Powered Design Workflows, Branding, Visual Identity"
    },
    {
      "category": "Languages",
      "items": "Turkish (Native), English (Professional Working Proficiency)"
    }
  ],
  "experience": [
    {
      "title": "UX UI Designer",
      "company": "IGLUU",
      "location": "Remote",
      "date": "Oct. 2025 - Present",
      "bullets": [
        "Designing product interfaces for a Czech real estate platform, working on broker tools, rental application flows, and ČSOB bank insurance partnership",
        "Iterating on designs through detailed feedback cycles with Product Owners and senior designers",
        "Working within established design system while identifying and proposing improvements to responsive design approaches",
        "Collaborating with developers on implementation, ensuring designs translate effectively across multiple breakpoints"
      ]
    },
    {
      "title": "Digital Product Designer",
      "company": "Freelancer",
      "location": "Remote",
      "date": "Oct. 2023 - Present",
      "bullets": [
        "Won branding award at Octant foundation's design competition for the Argot Collective Act Project, creating comprehensive logo design and brand identity system selected from international submissions",
        "Building Scrum Poker application from concept to deployment using AI-assisted development (Cursor), demonstrating end-to-end product design and full-stack development capability",
        "Delivering UI design, branding, and visual identity solutions for diverse clients, managing complete design lifecycle from discovery to final delivery",
        "Developing Bitrick, an AI-generated visual narrative series exploring advanced Midjourney techniques for maintaining character consistency across sequential storytelling",
        "Leveraging AI tools to accelerate design iteration cycles while maintaining high visual fidelity and user-centered design principles"
      ]
    },
    {
      "title": "UX UI Designer",
      "company": "Prove Us Wrong",
      "location": "Remote",
      "date": "Jan. 2022 - Oct. 2023",
      "bullets": [
        "Led user interface design for Truthpost platform (Kleros Incubator), establishing comprehensive design system and visual identity from ground up",
        "Created scalable design system in Figma with reusable component library, enabling consistent cross-platform experiences and efficient designer-developer handoff",
        "Collaborated with distributed international teams across multiple time zones on governance and coordination tools, translating complex technical requirements into intuitive user interfaces",
        "Produced visual assets using hybrid workflow combining AI tools (Midjourney) with traditional design software (Illustrator, Photoshop, Lightroom)",
        "Conducted user research and usability testing sessions to validate design decisions and inform iterative improvements throughout product development"
      ]
    },
    {
      "title": "UX UI Designer",
      "company": "Lumhar Design",
      "location": "İzmir, Turkey",
      "date": "Jul. 2021 - Jan. 2022",
      "bullets": [
        "Designed visually engaging, responsive, and modular interfaces tailored specifically for gaming audiences",
        "Applied user research insights to create intuitive user flows that enhanced overall user experience and engagement",
        "Collaborated closely with development team to ensure design feasibility and maintain visual quality through implementation"
      ]
    },
    {
      "title": "UX UI Designer",
      "company": "Artysmm Technology and Digital Consultancy Company",
      "location": "Remote",
      "date": "Jun. 2020 - Jan. 2021",
      "bullets": [
        "Conducted comprehensive website audit and recommended strategic improvements to enhance user experience and modern aesthetics",
        "Redesigned key website pages focusing on improved usability, visual hierarchy, and responsive design principles",
        "Worked with cross-functional team to implement design improvements while maintaining brand consistency"
      ]
    }
  ],
  "education": [
    {
      "school": "Gazi Üniversitesi",
      "degree": "B.S. Industrial Product Design, Faculty of Architecture",
      "location": "Ankara, Turkey",
      "date": "Sep. 2013 - Jul. 2019"
    }
  ]
}
